In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\coral\anaconda3\lib\site-packages (2.2.9)

WARNING: Ignoring invalid distribution -illow (c:\users\coral\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\coral\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\coral\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\coral\anaconda3\lib\site-packages)
WARNING: Ignoring invalid distribution -illow (c:\users\coral\anaconda3\lib\site-packages)

In [5]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "class630"
)
db = database.cursor()

In [16]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 77, 99, 48, 90, 72, 412, 83.0, 'A')
(5, 'Nabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(6, 'Sabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(7, 'Ram', 78, 90, 78, 87, 78, 423, 84.6, 'A')
(8, 'hari', 67, 89, 98, 93, 78, 437, 87.4, 'A')

In [7]:

db.execute("SELECT id, name, total, per, grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 412, 83.0, 'A')

In [15]:

db.execute("SELECT id, name, total, per, grade FROM student WHERE grade = 'A'")
result =db.fetchall()
for x in result:
    print(x)

(2, 'Shyam', 412, 83.0, 'A')
(5, 'Nabin', 400, 80.0, 'A')
(6, 'Sabin', 400, 80.0, 'A')
(7, 'Ram', 423, 84.6, 'A')
(8, 'hari', 437, 87.4, 'A')

In [9]:
db.execute("INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) 
           VALUES ('Nabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')")
database.commit()

In [14]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics marks = "))
    chemistry = int(input("Enter chemistry marks = "))
    math = int(input("Enter math marks = "))
    english = int(input("Enter english marks = "))
    nepali = int(input("Enter nepali marks = "))
    total =sum([physics,chemistry,math,english,neplai])
    per = total/5
    if per > 80:
        grade = "A"
    elif per > 60:
        grade = "B"
    elif per > 40:
        grade = "C"
    else:
        grade = "F"
    db.execute(f"INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade)  VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')")
    
database.commit()

Enter n = 2
Enter name = Ram
Enter physics marks = 78
Enter chemistry marks = 90
Enter math marks = 78
Enter english marks = 87
Enter nepali marks = 78
Enter name = hari
Enter physics marks = 67
Enter chemistry marks = 89
Enter math marks = 98
Enter english marks = 93
Enter nepali marks = 78

In [17]:
db.execute("DELETE FROM student WHERE id = 2")
database.commit()

In [18]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(5, 'Nabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(6, 'Sabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(7, 'Ram', 78, 90, 78, 87, 78, 423, 84.6, 'A')
(8, 'hari', 67, 89, 98, 93, 78, 437, 87.4, 'A')

In [21]:
db.execute("UPDATE student SET name = 'Ramprasad' WHERE name = 'Ram' ")
database.commit()

In [22]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(5, 'Nabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(6, 'Sabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(7, 'Ramprasad', 78, 90, 78, 87, 78, 423, 84.6, 'A')
(8, 'hari', 67, 89, 98, 93, 78, 437, 87.4, 'A')

In [30]:
initial_name = input("Enter name = ")
final_name = input("Enter final name = ")

db.execute(f"UPDATE student SET name = '{final_name}' WHERE name = '{initial_name}' ")
database.commit()

Enter name = ssd
Enter final name = Nabin

In [31]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(5, 'Nabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(6, 'Sabin', 78, 89, 56, 78, 76, 400, 80.0, 'A')
(7, 'Ramprasad', 78, 90, 78, 87, 78, 423, 84.6, 'A')
(8, 'hari', 67, 89, 98, 93, 78, 437, 87.4, 'A')